AliBaWazir/bicycletechnologies_firmware-1/NRF51822/NRF_SDK12/examples/ble_central/experimental/ble_app_cscs_c/pca10028/s130/arm5_no_packs/algorithm_app.c
/*
* Copyright (c) 2016 Shifty: Automatic Gear Selection System. All Rights Reserved.
 *
 * The code developed in this file is for the 4th year project: Shifty. The use,
 * copying, transfer or disclosure of such information is prohibited except by express written
 * agreement with the Shifty team.
 * Aportion of the source code here has been adopted from the Nordic Semiconductor' RSCS main application
 * Created by: Ali Ba Wazir
 * Oct 2016
 *
 */

/**
 * @brief Gear Selection Algoirthm.
 *
 */
 
 /**********************************************************************************************
* INCLUDES
***********************************************************************************************/
#include "sdk_config.h"
#include "boards.h"
#include "app_error.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include <math.h>
#define NRF_LOG_MODULE_NAME "ALGORITHM APP"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_delay.h"
#include "app_timer.h"
#include "drivers_commons.h"
#include "application_fds_app.h"

#include "algorithm_app.h"
#include "connection_manager_app.h"
#include "cscs_app.h"
#include "hrs_app.h"
#include "i2c_app.h"

/**********************************************************************************************
* MACRO DEFINITIONS
***********************************************************************************************/
#define OUTPUT_TO_MOTOR_CONTROLLER     0   //this flag is set to true if the algorithm output is to be sent to motor controller.
#define ALGORITHM_USES_HR_READING      0   //this flag is set to true only if alogrithm app uses HR reading to offset cadence_setpoint_rpm set by user

#define ALGORITHM_APP_SIM_ARRAY_SIZE   60  //size of arrays to store sim results
#define DEFAULT_CADENCE_SETPOINT_RPM   80
#define MAX_CADENCE_SETPOINT_OFFSET    10  //max offset for cadence setpoint

//Timer Defines
#define APP_TIMER_PRESCALER            0               /**< Value of the RTC1 PRESCALER register. If changed, remember to change prescaler in main.c*/
#define I2CAPP_MS_TO_TICK(MS) (APP_TIMER_TICKS(100, APP_TIMER_PRESCALER) * (MS / 100))
#define ALGORITHM_TIMER_PERIOD_MS      500            //time period in ms to run shifting algorithm
/**********************************************************************************************
* TYPE DEFINITIONS
***********************************************************************************************/
typedef enum{
	CADENCE_SETPOINT_UPDATE,
	BIKE_CONFIG_DATA_UPDATE
	
} algorithmApp_event_e;

typedef struct{
	float distance_traveled_m;
	uint32_t speed_kmh;
	uint32_t cadence_rpm;
	uint32_t hr_bpm;
} inst_sensors_metrics_t;

/**********************************************************************************************
* STATIC AND GLOBAL VARIABLES
***********************************************************************************************/
uint32_t cadence_setpoint_rpm = 0;
user_defined_bike_config_data_t  user_defined_bike_config_data;  //will contain user defined bike configuration data

static bool  gear_level_locked = false;                     /*TODO: this boolean has to be checked before running the gear shifting algorithm
															 *If set to true, lock gear level at the middle to maximize efficiency.  
															 */

static user_defined_bike_config_data_t default_bike_config;      //Struct will be initialized in the init function
static uint32_t default_cadence_setpoint_value = DEFAULT_CADENCE_SETPOINT_RPM;  //For now, if cadence setpoint is not already set, set it to default value

/*              | wheel gears -->
 *crankset gears|-------------------------------
 *              |
 */ 
static float gear_ratios_array [1][MAX_GEARS_COUNT];  /*the ratios array has a defined size but only the ratios for 
													   *actual gear indices will be populated. 
													   *Currently, the algorithm supports a single crank gear 
													   */
													   
static uint8_t current_wheel_gear_index  = 3; //initially cassete gear is at the middle
static uint8_t sim_result_arrays_index   = 0; //indexer for simulation result arrays
static uint8_t gear_index_after_shifting_array[ALGORITHM_APP_SIM_ARRAY_SIZE]; //array to store simulation results 
static uint8_t cadence_after_shifting_array[ALGORITHM_APP_SIM_ARRAY_SIZE];    //array to store simulation results 

//istantanious metrics to be processed by the algorithm and printed
inst_sensors_metrics_t inst_sensors_metrics;

/* IRQ toggling timer*/
APP_TIMER_DEF(algorithm_app_timer_id);
/**********************************************************************************************
* STATIC FUCNCTIONS
***********************************************************************************************/
static void algorithmApp_fire_event (algorithmApp_event_e event){
	switch (event){
		case CADENCE_SETPOINT_UPDATE:
			//store the new cadence_setpoint_rpm value in flash storage
			if(!applicationFdsApp_fds_store(USER_DEFINED_CADENCE_SETPOINT, (uint8_t*)&cadence_setpoint_rpm)){
				NRF_LOG_ERROR("algorithmApp_fire_event: applicationFdsApp_fds_store() failed to write cadence_setpoint_rpm\r\n");
			} else{
				//data will be read in the callback
			}
		break;
		
		case BIKE_CONFIG_DATA_UPDATE:
			//store the new user_defined_bike_config_data struct in flash storage
			if(!applicationFdsApp_fds_store(USER_DEFINED_BIKE_CONFIG_DATA, (uint8_t*)&user_defined_bike_config_data)){
				NRF_LOG_ERROR("algorithmApp_fire_event: applicationFdsApp_fds_store() failed to write bike config\r\n");
			} else{
				//data will be read in the callback
			}
		break;
		
		default:
			NRF_LOG_ERROR("algorithmApp_fire_event: called with invalid event= %d\r\n",event);
		break;
	}
	
}

static bool algorithmApp_gear_ratios_array_populate(void){
	
	bool retcode                  = true;
	uint8_t crankset_gears_count  = user_defined_bike_config_data.crank_gears_count;
	uint8_t wheel_gears_count     = user_defined_bike_config_data.wheel_gears_count;
	uint8_t i                     = 0;
	uint8_t j                     = 0;

