AliBaWazir/bicycletechnologies_firmware-1/NRF51822/NRF_SDK12/examples/ble_central/experimental/ble_app_cscs_c/pca10028/s130/arm5_no_packs/algorithm_app.c
	memset (gear_ratios_array, 0x00, (sizeof(gear_ratios_array)/sizeof(gear_ratios_array[0][0])));

	if(crankset_gears_count != 1){
		NRF_LOG_WARNING("algorithmApp_gear_ratios_array_populate: crankset_gears_count= %d has to be 1\r\n", crankset_gears_count)
		return false;
	}
	
	for (i=0; i<crankset_gears_count; i++){
		for (j=0; j<wheel_gears_count; j++ ){
			if(user_defined_bike_config_data.wheel_gears_teeth_count[j] == 0){
				//division by zero
				NRF_LOG_WARNING("algorithmApp_gear_ratios_array_populate: division by zero for wheel gear index= %d\r\n",
								 user_defined_bike_config_data.wheel_gears_teeth_count[j]);
			} else{
				gear_ratios_array[i][j]= ((float)user_defined_bike_config_data.crank_gears_teeth_count[i])/user_defined_bike_config_data.wheel_gears_teeth_count[j];
			}
		}
	}
	
	return retcode;
}

static float algorithmApp_get_inst_cadence_setpoint_rpm(){
	
	float result             = 0.0;
	float curr_hr_deviation  = 0.0;
		
	if(ALGORITHM_USES_HR_READING && connManagerApp_is_hr_periph_connected()){
		//offset the user-set cadence_setpoint_rpm at normal HR by the HR reading offset
		curr_hr_deviation= hrsApp_get_curr_hr_deviation();
		//bondary condition
		if (curr_hr_deviation < 1.0 && curr_hr_deviation > -1.0){
			result= cadence_setpoint_rpm - (hrsApp_get_curr_hr_deviation()*MAX_CADENCE_SETPOINT_OFFSET);
		} else if (curr_hr_deviation > 0){
			//poitive offset
			result= cadence_setpoint_rpm - MAX_CADENCE_SETPOINT_OFFSET;
		} else if (curr_hr_deviation < 0){
			//negative offset
			result= cadence_setpoint_rpm + MAX_CADENCE_SETPOINT_OFFSET;
		} else{
			//this should not be reached
			result= cadence_setpoint_rpm;
		}
	} else{
		result= cadence_setpoint_rpm;
	}
	
	return result;
}

static void algorithmApp_debug_print_algorithm_outputs(uint8_t wheel_gear_index, float cadence){
	
	if(!ALGORITHM_PRINTS_ALL_DATA){
		//print data of algorithm outputs only
		NRF_LOG_INFO("--------------------- ALGORITHM OUTPUT ------------------------\r\n");
		NRF_LOG_INFO("rear gear index= %d \r\n", wheel_gear_index);
		NRF_LOG_INFO("cadence        = %d \r\n", round(cadence));
		NRF_LOG_INFO("---------------------------------------------------------------------------------\r\n\r\n");
		
	} else{
		//print data from algorithm outputs and sensors data
		NRF_LOG_INFO("--------------------- CURRENT STATE ------------------------\r\n");
		NRF_LOG_INFO("distance travelled= %d (m)\r\n", inst_sensors_metrics.distance_traveled_m);
		NRF_LOG_INFO("bike speed= %d (kmph)\r\n", inst_sensors_metrics.speed_kmh);
		NRF_LOG_INFO("cadence before shifring= %d (rpm)\r\n", inst_sensors_metrics.cadence_rpm);
		NRF_LOG_INFO("heart rate= %d (bpm)\r\n\r\n", inst_sensors_metrics.hr_bpm);
		
		NRF_LOG_INFO("rear gear index= %d \r\n", wheel_gear_index);
		NRF_LOG_INFO("cadence after shifting= %d \r\n", round(cadence));
		NRF_LOG_INFO("----------------------------------------------------------------------------\r\n\r\n");
		
	}
	

	
}

static void algorithmApp_store_inst_sensors_metrics(){
	
	inst_sensors_metrics.distance_traveled_m    = cscsApp_copy_current_distance_m();
	inst_sensors_metrics.speed_kmh              = cscsApp_copy_current_speed_kmph();
	inst_sensors_metrics.cadence_rpm            = cscsApp_copy_current_cadence_rpm();
	inst_sensors_metrics.hr_bpm                 = hrsApp_copy_current_hr_bpm();
}

//function to run the shifting algorithm given the current state
static bool algorithmApp_run(void){
	
	bool retcode                                   = true;
	int j                                          = 0;
	float current_cadence_setpoint_rpm             = 0;
	float current_wheel_rpm                        = 0.0;
	float current_cycling_cadence                  = 0.0;
	float current_cycling_cadence_error            = 0.0;
	float expected_cycling_cadence                 = 0.0;
	float expected_cycling_cadence_error           = 0.0;
	float expected_cycling_cadence_error_previous  = 0.0;
	float cadence_after_shifting                   = 0.0;
	uint8_t desired_gear_wheel_index               = 0.0;
	bool looping_backword_in_ratios_array          = false;
		
    //if gear is locked keep the current state
	if(gear_level_locked){
		NRF_LOG_DEBUG("algorithmApp_run: gear level is locked\r\n");
		//for now, return false
		return false;
	}
	
	//NRF_LOG_DEBUG("algorithmApp_run: called\r\n");
	
	//store current sensors metrics if needed for later log printing
	if(ALGORITHM_PRINTS_ALL_DATA){
		algorithmApp_store_inst_sensors_metrics();
	}
	
	//calculate current cadence setpoint
	current_cadence_setpoint_rpm= algorithmApp_get_inst_cadence_setpoint_rpm();
	
	current_wheel_rpm = cscsApp_get_current_wheel_rpm();
	//NRF_LOG_DEBUG("algorithmApp_run: current wheel rpm= %d\r\n", current_wheel_rpm);
		
	current_cycling_cadence = current_wheel_rpm/(gear_ratios_array[0][current_wheel_gear_index]);
	//NRF_LOG_DEBUG("algorithmApp_run: current_cycling_cadence= %d\r\n", current_cycling_cadence);
		
	//calculate current cycling cadence relative error
	current_cycling_cadence_error = (float) ((current_cycling_cadence - current_cadence_setpoint_rpm));
	//NRF_LOG_DEBUG("algorithmApp_run: current_cycling_cadence_error= %d\r\n", current_cycling_cadence_error);
		
	if(current_cycling_cadence_error == 0){
		//keep current gear index
		desired_gear_wheel_index = current_wheel_gear_index;
	} else{
		    
		if (current_cycling_cadence_error >= 0){
			//loop backword throgh all wheel gears to select optimum gear
			looping_backword_in_ratios_array= true;
			//NRF_LOG_DEBUG("algorithmApp_run: loop backword ...\r\n");
		} else{
			//loop forward throgh all wheel gears to select optimum gear
			looping_backword_in_ratios_array= false;
			//NRF_LOG_DEBUG("algorithmApp_run: loop forward ...\r\n");
		}
    		
    	for (j= current_wheel_gear_index; 
			 (looping_backword_in_ratios_array&&(j>= 0)) || ((!looping_backword_in_ratios_array)&&(j< default_bike_config.wheel_gears_count));
			 (looping_backword_in_ratios_array?j--:j++))
		{
				
			//calculate expected cadence at gear index j
			expected_cycling_cadence = current_wheel_rpm/gear_ratios_array[0][j];
			//NRF_LOG_DEBUG("algorithmApp_run: expected_cycling_cadence for gear [%d]= %d\r\n",  j, expected_cycling_cadence);
			//store previous expected cycling cadence error
			expected_cycling_cadence_error_previous= expected_cycling_cadence_error;
			//calculate expected cycling cadence relative error
			expected_cycling_cadence_error = (float) (expected_cycling_cadence - current_cadence_setpoint_rpm);
			//check for sign change in expected relative error
			if ((expected_cycling_cadence_error>0 && current_cycling_cadence_error<0) || 
				(expected_cycling_cadence_error<0 && current_cycling_cadence_error>0))
			{
				break;
			}
			
