AliBaWazir/bicycletechnologies_firmware-1/NRF51822/NRF_SDK12/examples/ble_central/experimental/ble_app_cscs_c/pca10028/s130/arm5_no_packs/algorithm_app.c
		}
    		
		//NRF_LOG_DEBUG("algorithmApp_run: expected_cycling_cadence_error= %d. current_cycling_cadence_error= %d\r\n",  
		//					expected_cycling_cadence_error, current_cycling_cadence_error);
    	if (abs(expected_cycling_cadence_error) < abs(current_cycling_cadence_error)){
    		//check boundary conditions
    		if ( j>= default_bike_config.wheel_gears_count){
				//NRF_LOG_DEBUG("algorithmApp_run: >debug>>>>>>>>> 1\r\n");
				desired_gear_wheel_index = default_bike_config.wheel_gears_count-1;
    		} else if(j< 0){
				//NRF_LOG_DEBUG("algorithmApp_run: >debug>>>>>>>>> 2\r\n");
    			desired_gear_wheel_index = 0;
    		} else{
				//loop break due to sign change in cadence error
    			 if (abs(expected_cycling_cadence_error_previous) < abs(expected_cycling_cadence_error)){
					if(looping_backword_in_ratios_array){
						desired_gear_wheel_index = j+1;
					} else{
						desired_gear_wheel_index = j-1;
    			    }
    			 } else{
					desired_gear_wheel_index = j;
    			 }
    			    
    		}
    	} else {
    		//keep current gear index
    		desired_gear_wheel_index = current_wheel_gear_index;
    	}
	}

	//set current wheel gear with the desired gear
	current_wheel_gear_index = desired_gear_wheel_index;
	//NRF_LOG_DEBUG("algorithmApp_run: current_wheel_gear_index is set to gear with index[%d]\r\n", current_wheel_gear_index);
	//set_phisical_desired_gears(desired_gear_pedal_index, desired_gear_wheel_index);
		
	cadence_after_shifting = (current_wheel_rpm/gear_ratios_array[0][current_wheel_gear_index]);
	//NRF_LOG_DEBUG("algorithmApp_run: current_cadence after shifting= %d\r\n", cadence_after_shifting);
	

	//print the gear index after shifting and cadence after shifting
	algorithmApp_debug_print_algorithm_outputs(current_wheel_gear_index, cadence_after_shifting);
	
	if(!OUTPUT_TO_MOTOR_CONTROLLER){
		
		//store results in simulation vectors
		gear_index_after_shifting_array[sim_result_arrays_index]= current_wheel_gear_index;
		cadence_after_shifting_array[sim_result_arrays_index]= cadence_after_shifting;
		//increment the inexer of simulation results if size allows
		if((sim_result_arrays_index+1)<ALGORITHM_APP_SIM_ARRAY_SIZE){
			sim_result_arrays_index++;
		} else{
			NRF_LOG_DEBUG("algorithmApp_timer_handler: sim_result_arrays_index reached maximum \r\n");
		}
		
	} else {
		//send the new gear levels to the gear controller.
		if(!i2cApp_write_desired_gears(0, current_wheel_gear_index)){
			NRF_LOG_WARNING("algorithmApp_run: i2cApp_write_desired_gears failed\r\n");
			retcode= false;
		}
	}
	
	return retcode;
}

static void algorithmApp_timer_handler( void * callback_data){
	
	uint32_t* polling_request_id_p = (uint32_t*) callback_data;
	uint32_t  nrf_err              = NRF_SUCCESS;   
	
	/*TODO: figure out if this is necessary*/
	if (polling_request_id_p != NULL){
		NRF_LOG_DEBUG("algorithmApp_timer_handler: polling request with ID=%d timed out\r\n", *polling_request_id_p);
	}
	
	//stop timer

	(void)app_timer_stop(algorithm_app_timer_id);

	
	//run the gear shifting algorithm if a new CSCS measurement is received since starting
	if(cscsApp_is_new_cscs_meas_received()){
		
		algorithmApp_run();
		
	}
	
	//start timer againg
	nrf_err = app_timer_start(algorithm_app_timer_id, I2CAPP_MS_TO_TICK(ALGORITHM_TIMER_PERIOD_MS), (void*)NULL);
	if (nrf_err != NRF_SUCCESS)
	{
		NRF_LOG_ERROR("algorithmApp_timer_handler: app_timer_start failed with error = %d\r\n", nrf_err);
	}
}
/**********************************************************************************************
* PUBLIC FUCNCTIONS
***********************************************************************************************/

/************************* GETTERS ****************************/
uint8_t algorithmApp_get_cadence_setpoint(void){
	return (uint8_t)cadence_setpoint_rpm;
}

uint8_t algorithmApp_get_wheel_diameter_cm(void){
	return (uint8_t)user_defined_bike_config_data.wheel_diameter_cm;
}

uint8_t algorithmApp_get_gears_count_crank(void){
	return (uint8_t)user_defined_bike_config_data.crank_gears_count;
}

uint8_t algorithmApp_get_gears_count_wheel(void){
	return (uint8_t)user_defined_bike_config_data.wheel_gears_count;
}

uint8_t algorithmApp_get_teeth_count(uint8_t gear_type, uint8_t gear_index){
	
	if (gear_index >= MAX_GEARS_COUNT){
		NRF_LOG_WARNING("algorithmApp_get_teeth_count: called with grear index=%d higher than max gear count\r\n", gear_index);
		return 0;
	} else{
		if(gear_type == CRANK_IDENTIFIER){
			return (uint8_t)user_defined_bike_config_data.crank_gears_teeth_count[gear_index];
		} else if (gear_type == WHEEL_IDENTIFIER){
			return (uint8_t)user_defined_bike_config_data.wheel_gears_teeth_count[gear_index];
		}else{
			NRF_LOG_ERROR("algorithmApp_get_teeth_count: called with unknown gear_type=0x%x\r\n", gear_type);
			return 0;
		}
	}
}

/************************* SETTERS ****************************/
void algorithmApp_set_cadence_setpoint(uint8_t new_cadence_setpoint){
	
	cadence_setpoint_rpm = new_cadence_setpoint;
	//fire update event to encode updated data in ROM
	algorithmApp_fire_event(CADENCE_SETPOINT_UPDATE);
	
	NRF_LOG_INFO("algorithmApp_set_cadence_setpoint: cadence_setpoint is changed to= %d .\r\n",new_cadence_setpoint);
}

void algorithmApp_set_gear_level_locked(){
	gear_level_locked = true;
	NRF_LOG_INFO("algorithmApp_set_gear_level_locked: gear level is locked= %d .\r\n");

}

void algorithmApp_set_wheel_diameter (uint8_t new_wheel_diameter){
	
	user_defined_bike_config_data.wheel_diameter_cm = new_wheel_diameter;
	//fire update event to encode updated data in ROM
	algorithmApp_fire_event(BIKE_CONFIG_DATA_UPDATE);
	
	NRF_LOG_INFO("algorithmApp_set_wheel_diameter: wheel_diameter is changed to= %d .\r\n",new_wheel_diameter);
}

bool algorithmApp_set_gear_count(uint8_t crank_gears_count, uint8_t wheel_gears_count){
	
	if ((crank_gears_count > MAX_GEARS_COUNT) || (wheel_gears_count > MAX_GEARS_COUNT)){
		NRF_LOG_WARNING("algorithmApp_set_gear_count: crank_gears_count= %d or wheel_gears_count= %d is greater than MAX_GEARS_COUNT.\r\n",crank_gears_count, wheel_gears_count);
		return false;
	} else{
		user_defined_bike_config_data.crank_gears_count= crank_gears_count;
		user_defined_bike_config_data.wheel_gears_count= wheel_gears_count;
	}
	
	//fire update event to encode updated data in ROM
	algorithmApp_fire_event(BIKE_CONFIG_DATA_UPDATE);
	NRF_LOG_INFO("gear_count is changed to crank_gears_count= %d, wheel_gears_count= %d\r\n",crank_gears_count, wheel_gears_count);
	
