AliBaWazir/bicycletechnologies_firmware-1/NRF51822/NRF_SDK12/examples/ble_central/experimental/ble_app_cscs_c/pca10028/s130/arm5_no_packs/algorithm_app.c
	return true;
}

void algorithmApp_set_teeth_count (uint8_t gear_type, uint8_t gear_index, uint8_t new_teeth_count){
	
	bool teeth_is_updated    = false;
	
	if (gear_type == CRANK_IDENTIFIER){
		user_defined_bike_config_data.crank_gears_teeth_count[gear_index] = new_teeth_count;
		teeth_is_updated = true;
	} else if (gear_type == WHEEL_IDENTIFIER){
		user_defined_bike_config_data.wheel_gears_teeth_count[gear_index] = new_teeth_count;
		teeth_is_updated = true;
	} else {
		NRF_LOG_ERROR("algorithmApp_set_teeth_count: called with invalid gear_type= %d\r\n",gear_type);
	}
	
	if(teeth_is_updated){
		//fire update event to encode updated data in ROM
		algorithmApp_fire_event(BIKE_CONFIG_DATA_UPDATE);
		NRF_LOG_INFO("algorithmApp_set_teeth_count: teeth_count for gear type=%d in gear index[%d] is updated to count= %d.\r\n", gear_type, gear_index, new_teeth_count);
	}
	
}


bool algorithmApp_init(void){
	
	bool      ret_code  = true;
	uint32_t  nrf_err   = NRF_SUCCESS;
	
	memset (&gear_index_after_shifting_array, 0x00, ALGORITHM_APP_SIM_ARRAY_SIZE);
	memset (&cadence_after_shifting_array, 0x00, ALGORITHM_APP_SIM_ARRAY_SIZE);
	memset (&user_defined_bike_config_data, 0x00, sizeof(user_defined_bike_config_data_t));
	memset (&default_bike_config, 0x00, sizeof(user_defined_bike_config_data_t));
	default_bike_config.wheel_diameter_cm= 72;
	default_bike_config.crank_gears_count= 1;
	default_bike_config.crank_gears_teeth_count[0]= 32;
	default_bike_config.wheel_gears_count= 8;
	default_bike_config.wheel_gears_teeth_count[0]= 11;
	default_bike_config.wheel_gears_teeth_count[1]= 13;
	default_bike_config.wheel_gears_teeth_count[2]= 15;
	default_bike_config.wheel_gears_teeth_count[3]= 18;
	default_bike_config.wheel_gears_teeth_count[4]= 22; 
	default_bike_config.wheel_gears_teeth_count[5]= 26; 
	default_bike_config.wheel_gears_teeth_count[6]= 30; 
	default_bike_config.wheel_gears_teeth_count[7]= 34;

	
	/*decode bicycle preoperties defined by user from FDS to a static struct*/
	if(!applicationFdsApp_init(algorithmApp_gear_ratios_array_populate)){
		NRF_LOG_ERROR("algorithmApp_init: applicationFdsApp_init() failed\r\n");
		ret_code= false;
	} else{
		
		//read cadence setpoint from FDS
		if(!applicationFdsApp_fds_read(USER_DEFINED_CADENCE_SETPOINT, (uint8_t*) &cadence_setpoint_rpm)){
			
			NRF_LOG_WARNING("algorithmApp_init: applicationFdsApp_fds_read() failed. Default cadenceSetPoint value will be written\r\n");
			
			//TODO: figure out a way to ask user to enter cadence setpoint for fisrt time use.
			
			if(!applicationFdsApp_fds_store(USER_DEFINED_CADENCE_SETPOINT, (uint8_t*)&default_cadence_setpoint_value)){
				NRF_LOG_ERROR("algorithmApp_init: applicationFdsApp_fds_store() failed to write cadence_setpoint_rpm\r\n");
				ret_code= false;
			} else{
				//data will be read in the callback
			}
			
		} else{
			NRF_LOG_INFO("algorithmApp_init: cadence setpoint=%d is retrieved from flash data storage\r\n", cadence_setpoint_rpm);
		}
		
		if(ret_code){
			
			//wait for the app FDS writing activity to be done if it's running
			if(fds_app_busy_writing){
				//TODO: figure out how to schedule the next writing asynchronously using reserve()
				NRF_LOG_INFO("algorithmApp_init: waiting for FDS to finish writing data\r\n");
				while(fds_app_busy_writing);
			}
			

			//read bike configration data from FDS
			if(!applicationFdsApp_fds_read(USER_DEFINED_BIKE_CONFIG_DATA, (uint8_t*) &user_defined_bike_config_data)){
				NRF_LOG_WARNING("algorithmApp_init: applicationFdsApp_fds_read() failed. Bike default config will be written\r\n");
				
				/*TODO: figure out a way to ask user to enter bike configuration for fisrt time use.*/
				
				//For now, if cadence setpoint is not already set, set it to default value
				if(!applicationFdsApp_fds_store(USER_DEFINED_BIKE_CONFIG_DATA, (uint8_t*)&default_bike_config)){
					NRF_LOG_ERROR("algorithmApp_init: applicationFdsApp_fds_store() failed to write bike config\r\n");
					ret_code= false;
				} else{
					//data will be read in the callback
				}
			} else{
				NRF_LOG_INFO("algorithmApp_init: bike config struct is retrieved from flash data storage\r\n");
				
				//populate the gear ratios array
				if(!algorithmApp_gear_ratios_array_populate()){
					NRF_LOG_INFO("algorithmApp_init: algorithmApp_gear_ratios_array_populate failed\r\n");
					ret_code= false;
				}
			}
			
		}

	}
	
	if(ret_code){
		
		//create and start the timer
		nrf_err = app_timer_create(&algorithm_app_timer_id,
									APP_TIMER_MODE_SINGLE_SHOT,
									algorithmApp_timer_handler);
		if (nrf_err != NRF_SUCCESS){
			NRF_LOG_DEBUG("spisSimDriver_init: app_timer_create failed with error= %d\r\n", nrf_err);
			ret_code = false;
		} else{
			
			//start the timer
			nrf_err = app_timer_start(algorithm_app_timer_id, I2CAPP_MS_TO_TICK(ALGORITHM_TIMER_PERIOD_MS), (void*)NULL);
			if (nrf_err != NRF_SUCCESS)
			{
				NRF_LOG_ERROR("spisSimDriver_init: app_timer_start failed with error = %d\r\n", nrf_err);
				ret_code = false;
			}
			
		}
		
	}
	
	
	return ret_code;
}
